darin-noronha/motor_application/MOTOR Project/TLE9210x_FuncLayer.h
uint16_t TLE9210x_FuncLayer_get_Control_TDON_OFF2_TDOFF2(void);
uint8_t TLE9210x_FuncLayer_set_Control_TDON_OFF2_TDON2(uint16_t u16_data);
uint16_t TLE9210x_FuncLayer_get_Control_TDON_OFF2_TDON2(void);
uint8_t TLE9210x_FuncLayer_set_Control_TDON_OFF2(uint16_t u16_data);
uint8_t TLE9210x_FuncLayer_set_Control_TDON_OFF3_TDOFF3(uint16_t u16_data);
uint16_t TLE9210x_FuncLayer_get_Control_TDON_OFF3_TDOFF3(void);
uint8_t TLE9210x_FuncLayer_set_Control_TDON_OFF3_TDON3(uint16_t u16_data);
uint16_t TLE9210x_FuncLayer_get_Control_TDON_OFF3_TDON3(void);
uint8_t TLE9210x_FuncLayer_set_Control_TDON_OFF3(uint16_t u16_data);
uint16_t TLE9210x_FuncLayer_get_Status_GENSTAT_PASS_VDSOV(void);
uint16_t TLE9210x_FuncLayer_get_Status_GENSTAT_WDMON(void);
uint16_t TLE9210x_FuncLayer_get_Status_GENSTAT_PWM3STAT(void);
uint16_t TLE9210x_FuncLayer_get_Status_GENSTAT_PWM2STAT(void);
uint16_t TLE9210x_FuncLayer_get_Status_GENSTAT_PWM1STAT(void);
uint16_t TLE9210x_FuncLayer_get_Status_GENSTAT_TDREG3(void);
uint16_t TLE9210x_FuncLayer_get_Status_GENSTAT_TDREG2(void);
uint16_t TLE9210x_FuncLayer_get_Status_GENSTAT_TDREG1(void);
uint16_t TLE9210x_FuncLayer_get_Status_GENSTAT_TSD(void);
uint16_t TLE9210x_FuncLayer_get_Status_GENSTAT_TW(void);
uint16_t TLE9210x_FuncLayer_get_Status_GENSTAT_OC2(void);
uint16_t TLE9210x_FuncLayer_get_Status_GENSTAT_OC1(void);
uint16_t TLE9210x_FuncLayer_get_Status_GENSTAT_VSOV(void);
uint16_t TLE9210x_FuncLayer_get_Status_GENSTAT_VSUV(void);
uint16_t TLE9210x_FuncLayer_get_Status_GENSTAT_CPUV(void);
#if TLE9210x_Variant == TLE92108
uint16_t TLE9210x_FuncLayer_get_Status_DSOV_LS8DSOV(void);
uint16_t TLE9210x_FuncLayer_get_Status_DSOV_HS8DSOV(void);
uint16_t TLE9210x_FuncLayer_get_Status_DSOV_LS7DSOV(void);
uint16_t TLE9210x_FuncLayer_get_Status_DSOV_HS7DSOV(void);
uint16_t TLE9210x_FuncLayer_get_Status_DSOV_LS6DSOV(void);
uint16_t TLE9210x_FuncLayer_get_Status_DSOV_HS6DSOV(void);
uint16_t TLE9210x_FuncLayer_get_Status_DSOV_LS5DSOV(void);
uint16_t TLE9210x_FuncLayer_get_Status_DSOV_HS5DSOV(void);
#endif
uint16_t TLE9210x_FuncLayer_get_Status_DSOV_LS4DSOV(void);
uint16_t TLE9210x_FuncLayer_get_Status_DSOV_HS4DSOV(void);
uint16_t TLE9210x_FuncLayer_get_Status_DSOV_LS3DSOV(void);
uint16_t TLE9210x_FuncLayer_get_Status_DSOV_HS3DSOV(void);
uint16_t TLE9210x_FuncLayer_get_Status_DSOV_LS2DSOV(void);
uint16_t TLE9210x_FuncLayer_get_Status_DSOV_HS2DSOV(void);
uint16_t TLE9210x_FuncLayer_get_Status_DSOV_LS1DSOV(void);
uint16_t TLE9210x_FuncLayer_get_Status_DSOV_HS1DSOV(void);
#if TLE9210x_Variant == TLE92108
uint16_t TLE9210x_FuncLayer_get_Status_HBVOUT_PWMERR_HB8PWME(void);
uint16_t TLE9210x_FuncLayer_get_Status_HBVOUT_PWMERR_HB7PWME(void);
uint16_t TLE9210x_FuncLayer_get_Status_HBVOUT_PWMERR_HB6PWME(void);
uint16_t TLE9210x_FuncLayer_get_Status_HBVOUT_PWMERR_HB5PWME(void);
#endif
uint16_t TLE9210x_FuncLayer_get_Status_HBVOUT_PWMERR_HB4PWME(void);
uint16_t TLE9210x_FuncLayer_get_Status_HBVOUT_PWMERR_HB3PWME(void);
uint16_t TLE9210x_FuncLayer_get_Status_HBVOUT_PWMERR_HB2PWME(void);
uint16_t TLE9210x_FuncLayer_get_Status_HBVOUT_PWMERR_HB1PWME(void);
#if TLE9210x_Variant == TLE92108
uint16_t TLE9210x_FuncLayer_get_Status_HBVOUT_PWMERR_HB8VOUT(void);
uint16_t TLE9210x_FuncLayer_get_Status_HBVOUT_PWMERR_HB7VOUT(void);
uint16_t TLE9210x_FuncLayer_get_Status_HBVOUT_PWMERR_HB6VOUT(void);
uint16_t TLE9210x_FuncLayer_get_Status_HBVOUT_PWMERR_HB5VOUT(void);
#endif
uint16_t TLE9210x_FuncLayer_get_Status_HBVOUT_PWMERR_HB4VOUT(void);
uint16_t TLE9210x_FuncLayer_get_Status_HBVOUT_PWMERR_HB3VOUT(void);
uint16_t TLE9210x_FuncLayer_get_Status_HBVOUT_PWMERR_HB2VOUT(void);
uint16_t TLE9210x_FuncLayer_get_Status_HBVOUT_PWMERR_HB1VOUT(void);
uint16_t TLE9210x_FuncLayer_get_Status_EFF_TDON_OFF1_TDOFF1EFF(void);
uint16_t TLE9210x_FuncLayer_get_Status_EFF_TDON_OFF1_TDON1EFF(void);
uint16_t TLE9210x_FuncLayer_get_Status_EFF_TDON_OFF2_TDOFF2EFF(void);
uint16_t TLE9210x_FuncLayer_get_Status_EFF_TDON_OFF2_TDON2EFF(void);
uint16_t TLE9210x_FuncLayer_get_Status_EFF_TDON_OFF3_TDOFF3EFF(void);
uint16_t TLE9210x_FuncLayer_get_Status_EFF_TDON_OFF3_TDON3EFF(void);
uint16_t TLE9210x_FuncLayer_get_Status_TRISE_FALL1_TFALL1(void);
uint16_t TLE9210x_FuncLayer_get_Status_TRISE_FALL1_TRISE1(void);
uint16_t TLE9210x_FuncLayer_get_Status_TRISE_FALL2_TFALL2(void);
uint16_t TLE9210x_FuncLayer_get_Status_TRISE_FALL2_TRISE2(void);
uint16_t TLE9210x_FuncLayer_get_Status_TRISE_FALL3_TFALL3(void);
uint16_t TLE9210x_FuncLayer_get_Status_TRISE_FALL3_TRISE3(void);
uint16_t TLE9210x_FuncLayer_get_Status_DEVID_DEV_ID(void);

/** @}*/ /* End of group TLE9210x_FUNCTION_LAYER */

#endif /* TLE9210x_FUNCLAYER_H */
